DEPARTMENTS = [
    "개발부",
    "인사부",
    "영업부",
    "마케팅부",
    "기획부",
]

TEAMS = [
    "백엔드팀",
    "프론트팀",
    "AI팀",
    "인프라팀",
    "채용팀",
    "교육팀",
    "국내영업팀",
    "해외영업팀",
    "디지털마케팅팀",
    "브랜드팀",
    "전략기획팀",
    "사업기획팀",
]

JOB_GRADES = [
    "사장",
    "이사",
    "부장",
    "차장",
    "과장",
    "대리",
    "사원",
]

POSITIONS = [
    "대표이사",
    "본부장",
    "팀장",
    "팀원",
]

TEAM_TO_DEPARTMENT = {
    "백엔드팀": "개발부",
    "프론트팀": "개발부",
    "AI팀": "개발부",
    "인프라팀": "개발부",

    "채용팀": "인사부",
    "교육팀": "인사부",

    "국내영업팀": "영업부",
    "해외영업팀": "영업부",

    "디지털마케팅팀": "마케팅부",
    "브랜드팀": "마케팅부",

    "사업기획팀": "기획부",
    "전략기획팀": "기획부",
}
